In [1]:
import pandas as pd

In [3]:
fruits = ["apple","orange","mango"]

In [4]:
series = pd.Series(fruits)

In [5]:
series

0     apple
1    orange
2     mango
dtype: object

In [6]:
type(series)

pandas.core.series.Series

In [7]:
series.index

RangeIndex(start=0, stop=3, step=1)

In [8]:
# hamila index change garyo vana 
series.index = ["a","b","c"]

In [9]:
series

a     apple
b    orange
c     mango
dtype: object

In [13]:
# hamila data frame crate gardai xau hai taw 
# dictonery bnako
people = {
    "full_name":["tej saud", "ravi chand", "tirtha bhatta"],
    "email":["tej@test.com", "ravi@test.com", "tirtha@test.com"],
    "age":[20,40,50]
}

In [14]:
df = pd.DataFrame(people)

In [15]:
df

       full_name            email  age
0       tej saud     tej@test.com   20
1     ravi chand    ravi@test.com   40
2  tirtha bhatta  tirtha@test.com   50

In [16]:
type(df)

pandas.core.frame.DataFrame

In [17]:
# column return garda 
df.columns

Index(['full_name', 'email', 'age'], dtype='object')

In [18]:
# yauta column return garda 
df["email"]

0       tej@test.com
1      ravi@test.com
2    tirtha@test.com
Name: email, dtype: object

In [19]:
type(df["email"])

pandas.core.series.Series

In [21]:
# kunai two column pickout garo vana 
# ysto garda [] lagauna hai taw 
df[["email","age"]]

             email  age
0     tej@test.com   20
1    ravi@test.com   40
2  tirtha@test.com   50

In [23]:
type(df[["email","age"]])

pandas.core.frame.DataFrame

In [24]:
# jastai column retrive gara jastai row lai pani retrive garam hai taw 
df.loc[[0,1],"age"]

0    20
1    40
Name: age, dtype: int64

In [25]:
# jastai column retrive gara jastai row lai pani retrive garam hai taw 
df.loc[[0,1],"email"]

0     tej@test.com
1    ravi@test.com
Name: email, dtype: object

In [26]:
# hamila multipal lai ni pass garna sakxau hai taw 
df.loc[[0,1],["email","full_name"]]

           email   full_name
0   tej@test.com    tej saud
1  ravi@test.com  ravi chand

In [27]:
df

       full_name            email  age
0       tej saud     tej@test.com   20
1     ravi chand    ravi@test.com   40
2  tirtha bhatta  tirtha@test.com   50

In [28]:
# hamila extra two column chayo 
# first raw last name farak frak column chayo vana split garna hai taw 
def split_name(name,position):
    return name(position)

In [ ]:
df["first_name"] = df["full_name"].str.split().apply(split_name, position=0)

In [39]:
df

       full_name            email  age
0       tej saud     tej@test.com   20
1     ravi chand    ravi@test.com   40
2  tirtha bhatta  tirtha@test.com   50

In [ ]:
df["last_name"] = df["full_name"].str.split().apply(split_name, position=1)

In [41]:
df

       full_name            email  age
0       tej saud     tej@test.com   20
1     ravi chand    ravi@test.com   40
2  tirtha bhatta  tirtha@test.com   50

In [ ]:
df["name_length"] = df["full_name"].apply(len)

In [42]:
df

       full_name            email  age
0       tej saud     tej@test.com   20
1     ravi chand    ravi@test.com   40
2  tirtha bhatta  tirtha@test.com   50

In [1]:
pwd

'C:\\Users\\ganesh shaud'

In [55]:
# hamile extra column add garako sex vana 
people = {
    "full_name":["tej saud", "ravi chand", "tirtha bhatta"],
    "email":["tej@test.com", "ravi@test.com", "tirtha@test.com"],
    "age":[20,40,50],
    "sex":["male","female","male","female"]
}

In [ ]:
df = pd.DataFrame(people)

In [56]:
df

       full_name            email  age
0       tej saud     tej@test.com   20
1     ravi chand    ravi@test.com   40
2  tirtha bhatta  tirtha@test.com   50

In [58]:
df

       full_name            email  age
0       tej saud     tej@test.com   20
1     ravi chand    ravi@test.com   40
2  tirtha bhatta  tirtha@test.com   50

In [ ]:
df["sex"] = df["sex"].map({"male":0 , "female":1})

In [59]:
df

       full_name            email  age
0       tej saud     tej@test.com   20
1     ravi chand    ravi@test.com   40
2  tirtha bhatta  tirtha@test.com   50

In [3]:
pw

NameError: name 'pw' is not defined